app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
  	@todo_items = Todo.all

DELETE FROM "todos" WHERE "todos"."id" = 3
SELECT  "todos".* FROM "todos"   ORDER BY "todos"."id" DESC LIMIT 1
---
  def delete
  	@last=Todo.last.delete

INSERT INTO "todos" ("created_at", "todo_item", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-10-10 14:43:37.164744"], ["todo_item", "Test"], ["updated_at", "2014-10-10 14:43:37.164744"]]
---
  def add
  	Todo.create(:todo_item => params[:todo_text])